uat_chat/Catalogs/уатВидыДДД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>уатВидыДДД</Name>
			<Comment>(уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КонтрольВПЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляСотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>стрОтветсвенные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательныйДляВсех</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноеПодразделениеЕсть</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсключаемыеОбъектыКонтроля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектКонтроля</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТипыТС</v8:Type>
								<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
								<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Лог</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтветственныеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Емайл</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>55</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>WhatsApp</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Лог</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПодразделенияФильтр</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исключить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

uat_chat/Catalogs/уатВидыДДД/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;	// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения



// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СТАНДАРТНЫХ СОБЫТИЙ ОБЪЕКТА

// Стандартный обработчик ПередЗаписью элемента справочника
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда Возврат; КонецЕсли;
	
	ОбязательноеПодразделениеЕсть = Ложь;
	МасПодр = Новый Массив;
	Для каждого Стр из ПодразделенияФильтр Цикл
		Если масПодр.Найти(Стр.Подразделение)<>Неопределено ТОгда
			Сообщить("Подразделение "+Стр.Подразделение+" уже есть в таблице исключений!");
			отказ=Истина;
		КонецеСЛИ;
		масПодр.Добавить(Стр.Подразделение);
		
		Если Стр.Исключить = Ложь ТОгда
			ОбязательноеПодразделениеЕсть = истина;
			Прервать;
		КонецеСЛИ;
	КонецЦикла;
	
	пСтр = "";
	Для каждого Стр из ОтветственныеЛица Цикл
		пСтр = пСтр + ФИО(СТр.Ответственный)+" ";
	КонецЦикла;
	стрОтветсвенные = пСтр;
	
КонецПроцедуры

Функция ФИО(Стр)
	РЕз = "";
	пСтр = СтрЗаменить(СокрЛП(Стр)," ",Символы.ПС);
	
	п=СтрПолучитьСтроку(пСтр,1);
	ЕСли п = "" ТОгда Возврат Рез; КонецеСЛИ;
	Рез = РЕз+п;
	
	//п=СтрПолучитьСтроку(пСтр,2);
	//ЕСли п = "" ТОгда Возврат Рез; КонецеСЛИ;
	//Рез = РЕз+" "+Лев(п,1)+".";
	//
	//п=СтрПолучитьСтроку(пСтр,3);
	//ЕСли п = "" ТОгда Возврат Рез; КонецеСЛИ;
	//Рез = РЕз+""+Лев(п,1)+".";
	
	Возврат Рез;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
	Права = глПраваУАТ;
#КонецЕсли
